<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>VALUES</title>
    <link rel="stylesheet" href="../body.css">
    <link rel="stylesheet" href="../opening.css">
    <link rel="stylesheet" href="../buttons.css">
</head>
<style>
    .border {
        text-align: center;
        height: 120px;
    }
</style>
<body>
<?php
    include("config.php");

    try {
        $sql = "INSERT INTO `course` (`id`, `name`, `semester`, `credits`) VALUES
        ('БД', 'Бази от данни', 3, 6),
        ('БП', 'Базово програмиране', 1, 8),
        ('ДС', 'Дискретни структури', 3, 6),
        ('Е', 'Електроника', 1, 7),
        ('ЛА', 'Логика и автомати', 2, 8),
        ('МАТ1', 'Математика - I част', 1, 7),
        ('МАТ2', 'Математика - II част', 2, 9),
        ('ОК', 'Организация на компютъра', 3, 6),
        ('ООП1', 'Обектно-ориентирано програмиране - I част', 3, 7),
        ('СА', 'Системен анализ', 3, 6),
        ('САА', 'Синтез и анализ на алгоритми', 2, 9),
        ('ССП1', 'Спорт - I част', 1, 1),
        ('ССП2', 'Спорт - II част', 2, 1),
        ('ССП3', 'Спорт - III част', 3, 1),
        ('УЕБД', 'Уеб дизайн', 1, 7),
        ('УП1', 'Учебна практика - I част', 2, 1),
        ('ЧЕ', 'Чужд език', 2, 3);
        
        INSERT INTO `title_info` (`id`, `name`) VALUES
        (1, 'доц.'),
        (2, 'гл. ас.'),
        (3, 'ас.'),
        (4, 'преп.');
        
        INSERT INTO `degree_info` (`id`, `name`) VALUES
        ('ИИ', 'Изкуствен интелект'),
        ('ИКТ', 'Информационни и комуникационни технологии'),
        ('КС', 'Киберсигурност'),
        ('КСТ', 'Компютърни науки и технологии'),
        ('СИТ', 'Софтуерни и интернет технологии');
        
        INSERT INTO `department_info` (`id`, `name`) VALUES
        ('АП', 'Автоматизация на производството'),
        ('ЕООС', 'Екология и опазване на околната среда'),
        ('ЕТМЕ', 'Електронна техника и микроелектроника'),
        ('ИД', 'Индустриален дизайн'),
        ('ИМ', 'Индустриален мениджмънт'),
        ('КНТ', 'Компютърни науки и технологии'),
        ('КТТ', 'Комуникационна техника и технологии'),
        ('ММЕ', 'Механика и машинни елементи'),
        ('МТМ', 'Материалознание и технология на материалите'),
        ('МФ', 'Математика и физика'),
        ('Р', 'Растениевъдство'),
        ('СИТ', 'Софтуерни и интернет технологии'),
        ('ССП', 'Спорт'),
        ('ТТТ', 'Транспортна техника и технологии'),
        ('ЧЕО', 'Чуждоезиково обучение');
        
        INSERT INTO `student` (`id`, `firstName`, `middleName`, `surname`, `degree_id`, `year`, `email`, `address`) VALUES
        ('22621111', 'Иванчо', 'Иванчо', 'Иванчов', 'СИТ', 2, 'vankata@gmail.com', 'ул. Иван Иванов 33, Варна'),
        ('22621234', 'Гергана', 'Йорданова', 'Тодорова', 'СИТ', 2, 'geri.t@gmail.com', 'ул. Мир 1, Варна'),
        ('22621555', 'Стефан', 'Ивайлов', 'Стефанов', 'КС', 1, 'stef4o@gmail.com', 'бул. Не мога да измисля име 19, Бургас'),
        ('22621709', 'Ванеса', 'Руми', 'Ломбардо', 'СИТ', 2, 'vaneska@gmail.com', 'ул. Прилеп 13, Варна'),
        ('22621710', 'Йордан', 'Йорданов', 'Симеонов', 'СИТ', 2, 'dancho@gmail.com', 'ул. Междузвездни войни 17, Варна'),
        ('22621999', 'Донатела', '', 'Версаче', 'СИТ', 2, 'versace4ever@gmail.com', 'гр. Реджо Калабрия, Италия');
        
        INSERT INTO `grade_info` (`id`, `name`) VALUES
        (2, 'Слаб'),
        (3, 'Среден'),
        (4, 'Добър'),
        (5, 'Мн. Добър'),
        (6, 'Отличен');
        
        INSERT INTO `lecturer` (`id`, `name`, `title_id`, `phone`, `email`, `department_id`) VALUES
        (1, 'Д. Кирилова', 1, '', '', 'МФ'),
        (2, 'Г. Цветкова', 2, '', '', 'МФ'),
        (3, 'М. Стоева', 1, '', '', 'СИТ'),
        (4, 'Д. Петрова', 2, '', '', 'СИТ'),
        (5, 'М. Карова', 1, '', '', 'СИТ'),
        (6, 'Г. Ковачева', 2, '', '', 'СИТ'),
        (7, 'Я. Несторов', 4, '', '', 'ССП'),
        (8, 'Ем. Беков', 1, '', '', 'ЕТМЕ'),
        (9, 'Д. Михайлова', 2, '', '', 'ЕТМЕ'),
        (10, 'А. Николова', 2, '', '', 'МФ'),
        (11, 'Н. Калчева', 1, '', '', 'СИТ'),
        (12, 'П. Линова', 2, '', '', 'СИТ'),
        (13, 'Ю. Петкова', 1, '', '', 'КНТ'),
        (14, 'Л. Георгиев', 2, '', '', 'КНТ'),
        (15, 'Г. Господинова', 2, '', '', 'СИТ'),
        (16, 'Ес. Халид', 4, '', '', 'ЧЕО'),
        (17, 'Ст. Стоянов', 4, '', '', 'ССП'),
        (18, 'Д. Николаева', 2, '', '', 'СИТ'),
        (19, 'Савова', 1, '', '', 'ТТТ'),
        (20, 'К. Соленков', 3, '', '', 'ЕТМЕ'),
        (21, 'Г. Кунев', 1, '', '', 'СИТ'),
        (22, 'Д. Динев', 2, '', 'd.dinev@gmail.com', 'СИТ'),
        (23, 'Хр. Ненов', 1, '', '', 'СИТ'),
        (24, 'М. Тодорова', 2, '', '', 'СИТ'),
        (25, 'Н. Янчев', 4, '', '', 'ССП'),
        (26, 'Д. Стоянова', 2, '', 'stoyanova@abv.bg', 'СИТ');
        
        INSERT INTO `course_lecturer` (`course_id`, `lecturer_id`) VALUES
        ('БД', 21),
        ('БД', 22),
        ('БП', 5),
        ('БП', 6),
        ('ДС', 15),
        ('ДС', 18),
        ('Е', 8),
        ('Е', 9),
        ('ЛА', 13),
        ('ЛА', 15),
        ('МАТ1', 1),
        ('МАТ1', 2),
        ('МАТ2', 2),
        ('МАТ2', 10),
        ('ОК', 13),
        ('ОК', 14),
        ('ООП1', 23),
        ('ООП1', 26),
        ('СА', 24),
        ('САА', 11),
        ('САА', 12),
        ('ССП1', 7),
        ('ССП1', 17),
        ('ССП1', 25),
        ('ССП2', 7),
        ('ССП2', 17),
        ('ССП2', 25),
        ('ССП3', 7),
        ('ССП3', 17),
        ('ССП3', 25),
        ('УЕБД', 3),
        ('УЕБД', 4),
        ('УП1', 19),
        ('УП1', 20),
        ('ЧЕ', 16);
        
        INSERT INTO `grade` (`id`, `student_id`, `course_id`, `lecturer_id`, `date`) VALUES
        (4, '22621555', 'БП', 5, '2023-01-09'),
        (5, '22621555', 'МАТ1', 2, '2023-01-24'),
        (3, '22621555', 'МАТ2', 2, '2023-06-16'),
        (4, '22621555', 'ООП1', 23, '2024-01-15'),
        (6, '22621555', 'ССП2', 7, '2023-05-30'),
        (6, '22621709', 'БД', 21, '2024-01-11'),
        (6, '22621709', 'БП', 5, '2023-01-06'),
        (6, '22621709', 'ДС', 18, '2024-01-09'),
        (6, '22621709', 'Е', 8, '2023-01-10'),
        (6, '22621709', 'МАТ1', 1, '2023-01-10'),
        (6, '22621709', 'МАТ2', 10, '2023-06-23'),
        (5, '22621709', 'ОК', 13, '2024-01-26'),
        (5, '22621709', 'ООП1', 23, '2024-01-10'),
        (6, '22621709', 'СА', 24, '2024-01-31'),
        (6, '22621709', 'САА', 11, '2023-06-16'),
        (6, '22621709', 'ССП1', 7, '2023-01-22'),
        (6, '22621709', 'ССП2', 17, '2023-06-01'),
        (6, '22621709', 'ССП3', 7, '2024-01-09'),
        (6, '22621709', 'УЕБД', 3, '2023-01-24'),
        (6, '22621709', 'УП1', 19, '2023-05-23'),
        (6, '22621709', 'ЧЕ', 16, '2023-05-30'),
        (6, '22621999', 'МАТ1', 1, '2023-01-09'),
        (6, '22621999', 'МАТ2', 2, '2023-06-20'),
        (6, '22621999', 'ООП1', 23, '2024-01-15'),
        (6, '22621999', 'ССП3', 7, '2024-01-28'),
        (6, '22621999', 'УЕБД', 3, '2023-01-06'),
        (6, '22621999', 'ЧЕ', 16, '2023-05-20'),
        (4, '22621111', 'МАТ1', '1', '2023-01-03'),
        (3, '22621111', 'ООП1', '23', '2024-01-09'),
        (4, '22621234', 'ООП1', '23', '2024-01-15');";

        echo "<div class='container'>
        <div class='border'>
            <p class='white'>ДАННИТЕ<br><br>БЯХА ДОБАВЕНИ<br><br>УСПЕШНО!</p><br>
        </div>";

        if (!$conn->multi_query($sql))
        { echo 'Error: '. $conn->error;}

        $conn->close();
    } catch (Exception $e) {}
?>
        <div class="bottom">
            <a href="../index.php"><button class='home'></button></a>
        </div>
    </div> <!--container-->
</body>
</html>
